export const poolName = {
  温迪: '杯装之诗',
  可莉: '闪焰的驻足',
  达达利亚: '暂别冬都',
  钟离: '陵薮市朝',
  阿贝多: '深秘之息',
  甘雨: '浮生孰来',
  魈: '烟火之邀',
  刻晴: '鱼龙灯昼',
  胡桃: '赤团开时',
  优菈: '浪涌之瞬',
  枫原万叶: '叶落风随',
  神里绫华: '白鹭之庭',
  宵宫: '焰色天河',
  雷电将军: '影寂天下人',
  珊瑚宫心海: '浮岳虹珠',
  荒泷一斗: '鬼门斗宴',
  申鹤: '出尘入世',
  八重神子: '华紫樱绯',
  神里绫人: '苍流踏花',
  夜兰: '素霓伣天',
  提纳里: '巡御蘙荟',
  赛诺: '雳裁冥昭',
  妮露: '翩舞歈莲',
  纳西妲: '月草的赐慧',
  流浪者: '余火变相',
  艾尔海森: '敕诫枢谋',
  迪希雅: '烈阳烁金',
  白术: '心珠循琅',
  林尼: '光与影的戏术',
  那维莱特: '渊海界令',
  莱欧斯利: '劫中泛滥',
  芙宁娜: '众水的颂诗',
  娜维娅: '明花蔓舵',
  闲云: '鸾音鹤信',
  千织: '千云绘羽织',
  阿蕾奇诺: '炉边烬影',
  克洛琳德: '流霆贯夜',
  希格雯: '柔柔海露心',
  艾梅莉埃: '凝露轻芳',
  玛拉妮: '鲨鲨逐浪游',
  基尼奇: '巡火猎秘',
  希诺宁: '煅火的祝赐',
  恰斯卡: '饮羽散红',
  玛薇卡: '宿古的赫炎',
  茜特菈莉: '星边夜语',
  梦见月瑞希: '浮枕朝颜'
}

export const poolDetail = [{
  version: '1.0',
  half: '上半',
  from: '2020-09-28 06:00:00',
  to: '2020-10-18 17:59:59',
  char5: ['温迪'],
  char4: ['芭芭拉', '菲谢尔', '香菱'],
  weapon5: ['风鹰剑', '阿莫斯之弓'],
  weapon4: ['笛剑', '流浪乐章', '钟剑', '绝弦', '西风长枪']
}, {
  version: '1.0',
  half: '下半',
  from: '2020-10-20 18:00:00',
  to: '2020-11-10 14:59:59',
  char5: ['可莉'],
  char4: ['行秋', '诺艾尔', '砂糖'],
  weapon5: ['四风原典', '狼的末路'],
  weapon4: ['祭礼剑', '祭礼残章', '祭礼大剑', '祭礼弓', '匣里灭辰']
}, {
  version: '1.1',
  half: '上半',
  from: '2020-11-11 06:00:00',
  to: '2020-12-01 15:59:59',
  char5: ['达达利亚'],
  char4: ['迪奥娜', '北斗', '凝光'],
  weapon5: ['尘世之锁', '天空之翼'],
  weapon4: ['笛剑', '昭心', '雨裁', '弓藏', '西风长枪']
}, {
  version: '1.1',
  half: '下半',
  from: '2020-12-01 18:00:00',
  to: '2020-12-22 14:59:59',
  char5: ['钟离'],
  char4: ['辛焱', '雷泽', '重云'],
  weapon5: ['无工之剑', '贯虹之槊'],
  weapon4: ['匣里龙吟', '西风秘典', '钟剑', '西风猎弓', '匣里灭辰']
}, {
  version: '1.2',
  half: '上半',
  from: '2020-12-23 06:00:00',
  to: '2021-01-12 15:59:59',
  char5: ['阿贝多'],
  char4: ['菲谢尔', '砂糖', '班尼特'],
  weapon5: ['斫峰之刃', '天空之卷'],
  weapon4: ['西风剑', '祭礼残章', '西风大剑', '绝弦', '西风长枪']
}, {
  version: '1.2',
  half: '下半',
  from: '2021-01-12 18:00:00',
  to: '2021-02-02 14:59:59',
  char5: ['甘雨'],
  char4: ['香菱', '行秋', '诺艾尔'],
  weapon5: ['天空之傲', '阿莫斯之弓'],
  weapon4: ['祭礼剑', '昭心', '钟剑', '西风猎弓', '匣里灭辰']
}, {
  version: '1.3',
  half: '上半',
  from: '2021-02-03 06:00:00',
  to: '2021-02-17 15:59:59',
  char5: ['魈'],
  char4: ['迪奥娜', '北斗', '辛焱'],
  weapon5: ['磐岩结绿', '和璞鸢'],
  weapon4: ['笛剑', '昭心', '祭礼大剑', '弓藏', '西风长枪']
}, {
  version: '1.3',
  half: '中场',
  from: '2021-02-17 18:00:00',
  to: '2021-03-02 15:59:59',
  char5: ['刻晴'],
  char4: ['凝光', '班尼特', '芭芭拉'],
  weapon5: ['磐岩结绿', '和璞鸢', '狼的末路', '护摩之杖'],
  weapon4: ['匣里龙吟', '流浪乐章', '千岩古剑', '祭礼弓', '千岩长枪']
}, {
  version: '1.3',
  half: '下半',
  from: '2021-03-02 18:00:00',
  to: '2021-03-16 14:59:59',
  char5: ['胡桃'],
  char4: ['行秋', '香菱', '重云'],
  weapon5: ['狼的末路', '护摩之杖'],
  weapon4: ['匣里龙吟', '流浪乐章', '千岩古剑', '祭礼弓', '千岩长枪']
}, {
  version: '1.4',
  half: '上半',
  from: '2021-03-17 06:00:00',
  to: '2021-04-06 15:59:59',
  char5: ['温迪'],
  char4: ['砂糖', '雷泽', '诺艾尔'],
  weapon5: ['天空之刃', '终末嗟叹之诗'],
  weapon4: ['暗巷闪光', '暗巷的酒与诗', '西风大剑', '西风猎弓', '匣里灭辰']
}, {
  version: '1.4',
  half: '下半',
  from: '2021-04-06 18:00:00',
  to: '2021-04-27 14:59:59',
  char5: ['达达利亚'],
  char4: ['罗莎莉亚', '芭芭拉', '菲谢尔'],
  weapon5: ['四风原典', '天空之翼'],
  weapon4: ['西风剑', '西风秘典', '祭礼大剑', '暗巷猎手', '西风长枪']
}, {
  version: '1.5',
  half: '上半',
  from: '2021-04-28 06:00:00',
  to: '2021-05-18 17:59:59',
  char5: ['钟离'],
  char4: ['烟绯', '诺艾尔', '迪奥娜'],
  weapon5: ['斫峰之刃', '尘世之锁'],
  weapon4: ['笛剑', '昭心', '千岩古剑', '祭礼弓', '千岩长枪']
}, {
  version: '1.5',
  half: '下半',
  from: '2021-05-18 18:00:00',
  to: '2021-06-08 14:59:59',
  char5: ['优菈'],
  char4: ['辛焱', '行秋', '北斗'],
  weapon5: ['风鹰剑', '松籁响起之时'],
  weapon4: ['祭礼剑', '祭礼残章', '雨裁', '弓藏', '匣里灭辰']
}, {
  version: '1.6',
  half: '上半',
  from: '2021-06-09 06:00:00',
  to: '2021-06-29 17:59:59',
  char5: ['可莉'],
  char4: ['芭芭拉', '砂糖', '菲谢尔'],
  weapon5: ['四风原典', '天空之傲'],
  weapon4: ['匣里龙吟', '流浪乐章', '钟剑', '幽夜华尔兹', '西风长枪']
}, {
  version: '1.6',
  half: '下半',
  from: '2021-06-29 18:00:00',
  to: '2021-07-20 14:59:59',
  char5: ['枫原万叶'],
  char4: ['罗莎莉亚', '班尼特', '雷泽'],
  weapon5: ['苍古自由之誓', '天空之卷'],
  weapon4: ['暗巷闪光', '暗巷的酒与诗', '西风大剑', '暗巷猎手', '匣里灭辰']
}, {
  version: '2.0',
  half: '上半',
  from: '2021-07-21 06:00:00',
  to: '2021-08-10 17:59:59',
  char5: ['神里绫华'],
  char4: ['凝光', '重云', '烟绯'],
  weapon5: ['雾切之回光', '天空之脊'],
  weapon4: ['西风剑', '西风秘典', '祭礼大剑', '绝弦', '西风长枪']
}, {
  version: '2.0',
  half: '下半',
  from: '2021-08-10 18:00:00',
  to: '2021-08-31 14:59:59',
  char5: ['宵宫'],
  char4: ['早柚', '迪奥娜', '辛焱'],
  weapon5: ['天空之刃', '飞雷之弦振'],
  weapon4: ['祭礼剑', '祭礼残章', '雨裁', '西风猎弓', '匣里灭辰']
}, {
  version: '2.1',
  half: '上半',
  from: '2021-09-01 06:00:00',
  to: '2021-09-21 17:59:59',
  char5: ['雷电将军'],
  char4: ['九条裟罗', '香菱', '砂糖'],
  weapon5: ['无工之剑', '薙草之稻光'],
  weapon4: ['匣里龙吟', '流浪乐章', '钟剑', '祭礼弓', '西风长枪']
}, {
  version: '2.1',
  half: '下半',
  from: '2021-09-21 18:00:00',
  to: '2021-10-12 14:59:59',
  char5: ['珊瑚宫心海'],
  char4: ['罗莎莉亚', '北斗', '行秋'],
  weapon5: ['磐岩结绿', '不灭月华'],
  weapon4: ['笛剑', '西风秘典', '西风大剑', '绝弦', '匣里灭辰']
}, {
  version: '2.2',
  half: '上半',
  from: '2021-10-13 06:00:00',
  to: '2021-11-02 17:59:59',
  char5: ['达达利亚'],
  char4: ['凝光', '重云', '烟绯'],
  weapon5: ['尘世之锁', '冬极白星'],
  weapon4: ['西风剑', '昭心', '恶王丸', '弓藏', '西风长枪']
}, {
  version: '2.2',
  half: '下半',
  from: '2021-11-02 18:00:00',
  to: '2021-11-23 14:59:59',
  char5: ['胡桃'],
  char4: ['托马', '迪奥娜', '早柚'],
  weapon5: ['终末嗟叹之诗', '护摩之杖'],
  weapon4: ['祭礼剑', '流浪乐章', '雨裁', '曚云之月', '断浪长鳍']
}, {
  version: '2.3',
  half: '上半',
  from: '2021-11-24 06:00:00',
  to: '2021-12-14 17:59:59',
  char5: ['阿贝多', '优菈'],
  char4: ['班尼特', '诺艾尔', '罗莎莉亚'],
  weapon5: ['苍古自由之誓', '松籁响起之时'],
  weapon4: ['匣里龙吟', '暗巷的酒与诗', '祭礼大剑', '暗巷猎手', '匣里灭辰']
}, {
  version: '2.3',
  half: '下半',
  from: '2021-12-14 18:00:00',
  to: '2022-01-04 14:59:59',
  char5: ['荒泷一斗'],
  char4: ['五郎', '芭芭拉', '香菱'],
  weapon5: ['赤角石溃杵', '天空之翼'],
  weapon4: ['暗巷闪光', '祭礼残章', '钟剑', '幽夜华尔兹', '西风长枪']
}, {
  version: '2.4',
  half: '上半',
  from: '2022-01-05 06:00:00',
  to: '2022-01-25 17:59:59',
  char5: ['申鹤', '魈'],
  char4: ['云堇', '凝光', '重云'],
  weapon5: ['息灾', '和璞鸢'],
  weapon4: ['笛剑', '流浪乐章', '西风大剑', '西风猎弓', '千岩长枪']
}, {
  version: '2.4',
  half: '下半',
  from: '2022-01-25 18:00:00',
  to: '2022-02-15 14:59:59',
  char5: ['钟离', '甘雨'],
  char4: ['行秋', '北斗', '烟绯'],
  weapon5: ['阿莫斯之弓', '贯虹之槊'],
  weapon4: ['西风剑', '西风秘典', '千岩古剑', '祭礼弓', '匣里灭辰']
}, {
  version: '2.5',
  half: '上半',
  from: '2022-02-16 06:00:00',
  to: '2022-03-08 17:59:59',
  char5: ['八重神子'],
  char4: ['托马', '菲谢尔', '迪奥娜'],
  weapon5: ['磐岩结绿', '神乐之真意'],
  weapon4: ['祭礼剑', '昭心', '雨裁', '绝弦', '断浪长鳍']
}, {
  version: '2.5',
  half: '下半',
  from: '2022-03-08 18:00:00',
  to: '2022-03-29 14:59:59',
  char5: ['雷电将军', '珊瑚宫心海'],
  char4: ['班尼特', '辛焱', '九条裟罗'],
  weapon5: ['不灭月华', '薙草之稻光'],
  weapon4: ['匣里龙吟', '恶王丸', '祭礼残章', '曚云之月', '西风长枪']
}, {
  version: '2.6',
  half: '上半',
  from: '2022-03-30 06:00:00',
  to: '2022-04-19 17:59:59',
  char5: ['神里绫人', '温迪'],
  char4: ['砂糖', '香菱', '云堇'],
  weapon5: ['波乱月白经津', '终末嗟叹之诗'],
  weapon4: ['笛剑', '流浪乐章', '祭礼大剑', '弓藏', '匣里灭辰']
}, {
  version: '2.6',
  half: '下半',
  from: '2022-04-19 18:00:00',
  to: '2022-05-31 05:59:59',
  char5: ['神里绫华'],
  char4: ['早柚', '雷泽', '罗莎莉亚'],
  weapon5: ['雾切之回光', '无工之剑'],
  weapon4: ['西风剑', '西风秘典', '钟剑', '西风猎弓', '西风长枪']
}, {
  version: '2.7',
  half: '上半',
  from: '2022-05-31 06:00:00',
  to: '2022-06-21 17:59:59',
  char5: ['夜兰', '魈'],
  char4: ['诺艾尔', '芭芭拉', '烟绯'],
  weapon5: ['若水', '和璞鸢'],
  weapon4: ['祭礼剑', '昭心', '西风大剑', '祭礼弓', '千岩长枪']
}, {
  version: '2.7',
  half: '下半',
  from: '2022-06-21 18:00:00',
  to: '2022-07-12 14:59:59',
  char5: ['荒泷一斗'],
  char4: ['五郎', '久岐忍', '重云'],
  weapon5: ['尘世之锁', '赤角石溃杵'],
  weapon4: ['匣里龙吟', '祭礼残章', '千岩古剑', '绝弦', '匣里灭辰']
}, {
  version: '2.8',
  half: '上半',
  from: '2022-07-13 06:00:00',
  to: '2022-08-02 17:59:59',
  char5: ['枫原万叶', '可莉'],
  char4: ['鹿野院平藏', '托马', '凝光'],
  weapon5: ['苍古自由之誓', '四风原典'],
  weapon4: ['暗巷闪光', '流浪乐章', '雨裁', '幽夜华尔兹', '西风长枪']
}, {
  version: '2.8',
  half: '下半',
  from: '2022-08-02 18:00:00',
  to: '2022-08-23 14:59:59',
  char5: ['宵宫'],
  char4: ['云堇', '辛焱', '班尼特'],
  weapon5: ['斫峰之刃', '飞雷之弦振'],
  weapon4: ['笛剑', '暗巷的酒与诗', '祭礼大剑', '暗巷猎手', '匣里灭辰']
}, {
  version: '3.0',
  half: '上半',
  from: '2022-08-24 06:00:00',
  to: '2022-09-09 17:59:59',
  char5: ['提纳里', '钟离'],
  char4: ['柯莱', '迪奥娜', '菲谢尔'],
  weapon5: ['猎人之径', '贯虹之槊'],
  weapon4: ['西风剑', '西风秘典', '钟剑', '绝弦', '西风长枪']
}, {
  version: '3.0',
  half: '下半',
  from: '2022-09-09 18:00:00',
  to: '2022-09-27 14:59:59',
  char5: ['甘雨', '珊瑚宫心海'],
  char4: ['多莉', '砂糖', '行秋'],
  weapon5: ['不灭月华', '阿莫斯之弓'],
  weapon4: ['祭礼剑', '昭心', '西风大剑', '弓藏', '匣里灭辰']
}, {
  version: '3.1',
  half: '上半',
  from: '2022-09-28 06:00:00',
  to: '2022-10-14 17:59:59',
  char5: ['赛诺', '温迪'],
  char4: ['坎蒂丝', '久岐忍', '早柚'],
  weapon5: ['终末嗟叹之诗', '赤沙之杖'],
  weapon4: ['匣里龙吟', '祭礼残章', '玛海菈的水色', '西风猎弓', '西风长枪']
}, {
  version: '3.1',
  half: '下半',
  from: '2022-10-14 18:00:00',
  to: '2022-11-01 14:59:59',
  char5: ['妮露', '阿贝多'],
  char4: ['北斗', '芭芭拉', '香菱'],
  weapon5: ['圣显之钥', '磐岩结绿'],
  weapon4: ['西福斯的月光', '流浪的晚星', '雨裁', '祭礼弓', '匣里灭辰']
}, {
  version: '3.2',
  half: '上半',
  from: '2022-11-02 06:00:00',
  to: '2022-11-18 17:59:59',
  char5: ['纳西妲', '宵宫'],
  char4: ['雷泽', '诺艾尔', '班尼特'],
  weapon5: ['千夜浮梦', '飞雷之弦振'],
  weapon4: ['笛剑', '流浪乐章', '祭礼大剑', '弓藏', '西风长枪']
}, {
  version: '3.2',
  half: '下半',
  from: '2022-11-18 18:00:00',
  to: '2022-12-06 14:59:59',
  char5: ['八重神子', '达达利亚'],
  char4: ['莱依拉', '托马', '鹿野院平藏'],
  weapon5: ['神乐之真意', '冬极白星'],
  weapon4: ['西风剑', '西风秘典', '钟剑', '绝弦', '匣里灭辰']
}, {
  version: '3.3',
  half: '上半',
  from: '2022-12-07 06:00:00',
  to: '2022-12-27 17:59:59',
  char5: ['流浪者', '荒泷一斗'],
  char4: ['珐露珊', '五郎', '烟绯'],
  weapon5: ['图莱杜拉的回忆', '赤角石溃杵'],
  weapon4: ['祭礼剑', '昭心', '西风大剑', '西风猎弓', '断浪长鳍']
}, {
  version: '3.3',
  half: '下半',
  from: '2022-12-27 18:00:00',
  to: '2023-01-17 14:59:59',
  char5: ['雷电将军', '神里绫人'],
  char4: ['罗莎莉亚', '早柚', '九条裟罗'],
  weapon5: ['波乱月白经津', '薙草之稻光'],
  weapon4: ['匣里龙吟', '祭礼残章', '恶王丸', '曚云之月', '西风长枪']
}, {
  version: '3.4',
  half: '上半',
  from: '2023-01-18 06:00:00',
  to: '2023-02-07 17:59:59',
  char5: ['艾尔海森', '魈'],
  char4: ['瑶瑶', '云堇', '辛焱'],
  weapon5: ['裁叶萃光', '和璞鸢'],
  weapon4: ['笛剑', '流浪乐章', '雨裁', '祭礼弓', '千岩长枪']
}, {
  version: '3.4',
  half: '下半',
  from: '2023-02-07 18:00:00',
  to: '2023-02-28 14:59:59',
  char5: ['胡桃', '夜兰'],
  char4: ['行秋', '凝光', '北斗'],
  weapon5: ['若水', '护摩之杖'],
  weapon4: ['西风剑', '西风秘典', '千岩古剑', '弓藏', '匣里灭辰']
}, {
  version: '3.5',
  half: '上半',
  from: '2023-03-01 06:00:00',
  to: '2023-03-21 17:59:59',
  char5: ['迪希雅', '赛诺'],
  char4: ['班尼特', '芭芭拉', '柯莱'],
  weapon5: ['苇海信标', '赤沙之杖'],
  weapon4: ['暗巷闪光', '昭心', '祭礼大剑', '暗巷猎手', '匣里灭辰']
}, {
  version: '3.5',
  half: '下半',
  from: '2023-03-21 18:00:00',
  to: '2023-04-11 14:59:59',
  char5: ['申鹤', '神里绫华'],
  char4: ['米卡', '砂糖', '迪奥娜'],
  weapon5: ['息灾', '雾切之回光'],
  weapon4: ['暗巷的酒与诗', '祭礼剑', '钟剑', '西风长枪', '西风猎弓']
}, {
  version: '3.6',
  half: '上半',
  from: '2023-04-12 06:00:00',
  to: '2023-05-02 17:59:59',
  char5: ['妮露', '纳西妲'],
  char4: ['多莉', '久岐忍', '莱伊拉'],
  weapon5: ['圣显之钥', '千夜浮梦'],
  weapon4: ['西福斯的月光', '西风大剑', '匣里灭辰', '祭礼残章', '绝弦']
}, {
  version: '3.6',
  half: '下半',
  from: '2023-05-02 18:00:00',
  to: '2023-05-23 14:59:59',
  char5: ['白术', '甘雨'],
  char4: ['坎蒂丝', '菲谢尔', '卡维'],
  weapon5: ['碧落之珑', '阿莫斯之弓'],
  weapon4: ['祭礼弓', '匣里龙吟', '西风长枪', '流浪晚星', '玛海菈的水色']
}, {
  version: '3.7',
  half: '上半',
  from: '2023-05-24 06:00:00',
  to: '2023-06-13 17:59:59',
  char5: ['宵宫', '八重神子'],
  char4: ['绮良良', '云堇', '重云'],
  weapon5: ['飞雷之弦振', '神乐之真意'],
  weapon4: ['恶王丸', '笛剑', '匣里灭辰', '流浪乐章', '弓藏']
}, {
  version: '3.7',
  half: '下半',
  from: '2023-06-13 18:00:00',
  to: '2023-07-04 14:59:59',
  char5: ['艾尔海森', '枫原万叶'],
  char4: ['瑶瑶', '鹿野院平藏', '香菱'],
  weapon5: ['裁叶萃光', '苍古自由之誓'],
  weapon4: ['断浪长鳍', '曚云之月', '西风剑', '祭礼大剑', '西风秘典']
}, {
  version: '3.8',
  half: '上半',
  from: '2023-07-05 06:00:00',
  to: '2023-07-25 17:59:59',
  char5: ['优菈', '可莉'],
  char4: ['米卡', '雷泽', '托马'],
  weapon5: ['松籁响起之时', '四风原典'],
  weapon4: ['暗巷闪光', '暗巷猎手', '雨裁', '西风长枪', '昭心']
}, {
  version: '3.8',
  half: '下半',
  from: '2023-07-25 18:00:00',
  to: '2023-08-15 14:59:59',
  char5: ['流浪者', '珊瑚宫心海'],
  char4: ['珐露珊', '罗莎莉亚', '烟绯'],
  weapon5: ['不灭月华', '图莱杜拉的回忆'],
  weapon4: ['暗巷的酒与诗', '匣里龙吟', '钟剑', '匣里灭辰', '西风猎弓']
}, {
  version: '4.0',
  half: '上半',
  from: '2023-08-16 06:00:00',
  to: '2023-09-05 17:59:59',
  char5: ['林尼', '夜兰'],
  char4: ['琳妮特', '班尼特', '芭芭拉'],
  weapon5: ['最初的大魔术', '若水'],
  weapon4: ['祭礼剑', '西风大剑', '西风长枪', '祭礼残章', '祭礼弓']
}, {
  version: '4.0',
  half: '下半',
  from: '2023-09-05 18:00:00',
  to: '2023-09-26 14:59:59',
  char5: ['钟离', '达达利亚'],
  char4: ['菲米尼', '早柚', '诺艾尔'],
  weapon5: ['贯虹之槊', '冬极白星'],
  weapon4: ['笛剑', '祭礼大剑', '匣里灭辰', '流浪乐章', '弓藏']
}, {
  version: '4.1',
  half: '上半',
  from: '2023-09-27 06:00:00',
  to: '2023-10-17 17:59:59',
  char5: ['那维莱特', '胡桃'],
  char4: ['菲谢尔', '行秋', '迪奥娜'],
  weapon5: ['万世流涌大典', '护摩之杖'],
  weapon4: ['船坞长剑', '便携动力锯', '幽夜华尔兹', '西风长枪', '西风秘典']
}, {
  version: '4.1',
  half: '下半',
  from: '2023-10-17 18:00:00',
  to: '2023-11-07 14:59:59',
  char5: ['莱欧斯利', '温迪'],
  char4: ['重云', '托马', '多莉'],
  weapon5: ['金流监督', '终末嗟叹之诗'],
  weapon4: ['勘探钻机', '测距规', '西风剑', '雨裁', '昭心']
}, {
  version: '4.2',
  half: '上半',
  from: '2023-11-08 06:00:00',
  to: '2023-11-28 17:59:59',
  char5: ['芙宁娜', '白术'],
  char4: ['夏洛蒂', '柯莱', '北斗'],
  weapon5: ['静水流涌之辉', '碧落之珑'],
  weapon4: ['祭礼剑', '钟剑', '匣里灭辰', '祭礼残章', '绝弦']
}, {
  version: '4.2',
  half: '下半',
  from: '2023-11-28 18:00:00',
  to: '2023-12-19 14:59:59',
  char5: ['赛诺', '神里绫人'],
  char4: ['绮良良', '久岐忍', '香菱'],
  weapon5: ['赤沙之杖', '波乱月白经津'],
  weapon4: ['匣里龙吟', '西风大剑', '西风长枪', '流浪乐章', '西风猎弓']
}, {
  version: '4.3',
  half: '上半',
  from: '2023-12-20 06:00:00',
  to: '2024-01-09 17:59:59',
  char5: ['娜维娅', '神里绫华'],
  char4: ['砂糖', '罗莎莉亚', '坎蒂丝'],
  weapon5: ['裁断', '雾切之回光'],
  weapon4: ['恶王丸', '曚云之月', '笛剑', '匣里灭辰', '西风秘典']
}, {
  version: '4.3',
  half: '下半',
  from: '2024-01-09 18:00:00',
  to: '2024-01-30 14:59:59',
  char5: ['雷电将军', '宵宫'],
  char4: ['夏沃蕾', '九条裟罗', '班尼特'],
  weapon5: ['薙草之稻光', '飞雷之弦振'],
  weapon4: ['断浪长鳍', '西风剑', '雨裁', '昭心', '弓藏']
}, {
  version: '4.4',
  half: '上半',
  from: '2024-01-31 06:00:00',
  to: '2024-02-20 17:59:59',
  char5: ['闲云', '纳西妲'],
  char4: ['嘉明', '珐露珊', '诺艾尔'],
  weapon5: ['鹤鸣余音', '千夜浮梦'],
  weapon4: ['千岩长枪', '祭礼剑', '祭礼大剑', '祭礼残章', '祭礼弓']
}, {
  version: '4.4',
  half: '下半',
  from: '2024-02-20 18:00:00',
  to: '2024-03-12 14:59:59',
  char5: ['魈', '八重神子'],
  char4: ['瑶瑶', '辛焱', '凝光'],
  weapon5: ['和璞鸢', '神乐之真意'],
  weapon4: ['千岩古剑', '匣里龙吟', '西风长枪', '流浪乐章', '绝弦']
}, {
  version: '4.5',
  half: '上半',
  from: '2024-03-13 06:00:00',
  to: '2024-04-02 17:59:59',
  char5: ['千织', '荒泷一斗'],
  char4: ['五郎', '云堇', '多莉'],
  weapon5: ['有乐御簾切', '赤角石溃杵'],
  weapon4: ['暗巷闪光', '暗巷猎手', '钟剑', '匣里灭辰', '西风秘典']
}, {
  version: '4.5',
  half: '下半',
  from: '2024-04-02 18:00:00',
  to: '2024-04-23 14:59:59',
  char5: ['那维莱特', '枫原万叶'],
  char4: ['芭芭拉', '行秋', '烟绯'],
  weapon5: ['万世流涌大典', '苍古自由之誓'],
  weapon4: ['暗巷的酒与诗', '幽夜华尔兹', '笛剑', '西风大剑', '西风长枪']
}, {
  version: '4.6',
  half: '上半',
  from: '2024-04-24 06:00:00',
  to: '2024-05-14 17:59:59',
  char5: ['阿蕾奇诺', '林尼'],
  char4: ['菲米尼', '琳妮特', '香菱'],
  weapon5: ['赤月之形', '最初的大魔术'],
  weapon4: ['船坞长剑', '便携动力锯', '匣里灭辰', '昭心', '西风猎弓']
}, {
  version: '4.6',
  half: '下半',
  from: '2024-05-14 18:00:00',
  to: '2024-06-04 14:59:59',
  char5: ['流浪者', '白术'],
  char4: ['莱依拉', '珐露珊', '北斗'],
  weapon5: ['图莱杜拉的回忆', '碧落之珑'],
  weapon4: ['勘探钻机', '测距规', '西风剑', '雨裁', '祭礼残章']
}, {
  version: '4.7',
  half: '上半',
  from: '2024-06-05 06:00:00',
  to: '2024-06-25 17:59:59',
  char5: ['克洛琳德', '艾尔海森'],
  char4: ['赛索斯', '班尼特', '托马'],
  weapon5: ['赦罪', '裁叶萃光'],
  weapon4: ['千岩长枪', '祭礼剑', '祭礼大剑', '流浪乐章', '绝弦']
}, {
  version: '4.7',
  half: '下半',
  from: '2024-06-25 18:00:00',
  to: '2024-07-16 14:59:59',
  char5: ['希格雯', '芙宁娜'],
  char4: ['诺艾尔', '嘉明', '罗莎莉亚'],
  weapon5: ['白雨心弦', '静水流涌之辉'],
  weapon4: ['千岩古剑', '匣里龙吟', '西风长枪', '西风秘典', '祭礼弓']
}, {
  version: '4.8',
  half: '上半',
  from: '2024-07-17 06:00:00',
  to: '2024-08-06 17:59:59',
  char5: ['娜维娅', '妮露'],
  char4: ['绮良良', '卡维', '凝光'],
  weapon5: ['裁断', '圣显之钥'],
  weapon4: ['西福斯的月光', '钟剑', '匣里灭辰', '昭心', '弓藏']
}, {
  version: '4.8',
  half: '下半',
  from: '2024-08-06 18:00:00',
  to: '2024-08-27 14:59:59',
  char5: ['艾梅莉埃', '夜兰'],
  char4: ['烟绯', '香菱', '雷泽'],
  weapon5: ['柔灯挽歌', '若水'],
  weapon4: ['玛海菈的水色', '流浪的晚星', '笛剑', '西风长枪', '西风猎弓']
}, {
  version: '5.0',
  half: '上半',
  from: '2024-08-28 06:00:00',
  to: '2024-09-17 17:59:59',
  char5: ['玛拉妮', '枫原万叶'],
  char4: ['卡齐娜', '辛焱', '班尼特'],
  weapon5: ['冲浪时光', '苍古自由之誓'],
  weapon4: ['西风剑', '西风大剑', '匣里灭辰', '祭礼残章', '绝弦']
}, {
  version: '5.0',
  half: '下半',
  from: '2024-09-17 18:00:00',
  to: '2024-10-08 14:59:59',
  char5: ['基尼奇', '雷电将军'],
  char4: ['托马', '九条裟罗', '夏沃蕾'],
  weapon5: ['山王长牙', '薙草之稻光'],
  weapon4: ['祭礼剑', '雨裁', '西风长枪', '流浪乐章', '祭礼弓']
}, {
  version: '5.1',
  half: '上半',
  from: '2024-10-09 06:00:00',
  to: '2024-10-29 17:59:59',
  char5: ['希诺宁', '千织'],
  char4: ['多莉', '坎蒂丝', '柯莱'],
  weapon5: ['岩峰巡歌', '有乐御簾切'],
  weapon4: ['弥坚骨', '镇山之钉', '祭礼大剑', '西风秘典', '弓藏']
}, {
  version: '5.1',
  half: '下半',
  from: '2024-10-29 18:00:00',
  to: '2024-11-19 14:59:59',
  char5: ['纳西妲', '胡桃'],
  char4: ['赛索斯', '行秋', '久岐忍'],
  weapon5: ['千夜浮梦', '护摩之杖'],
  weapon4: ['硕果钩', '匣里龙吟', '匣里灭辰', '昭心', '西风猎弓']
}, {
  version: '5.2',
  half: '上半',
  from: '2024-11-20 06:00:00',
  to: '2024-12-10 17:59:59',
  char5: ['恰斯卡', '林尼'],
  char4: ['欧洛伦', '砂糖', '芭芭拉'],
  weapon5: ['星鹫赤羽', '最初的大魔术'],
  weapon4: ['乘浪的回旋', '缀花之翎', '笛剑', '钟剑', '西风长枪']
}, {
  version: '5.2',
  half: '下半',
  from: '2024-12-10 18:00:00',
  to: '2024-12-31 14:59:59',
  char5: ['那维莱特', '钟离'],
  char4: ['鹿野院平藏', '菲谢尔', '瑶瑶'],
  weapon5: ['万世流涌大典', '贯虹之槊'],
  weapon4: ['幽夜华尔兹', '西风剑', '西风大剑', '匣里灭辰', '祭礼残章']
}, {
  version: '5.3',
  half: '上半',
  from: '2025-01-01 06:00:00',
  to: '2025-01-21 17:59:59',
  char5: ['玛薇卡', '茜特菈莉'],
  char4: ['卡齐娜', '班尼特', '迪奥娜'],
  weapon5: ['焚曜千阳', '祭星者之望'],
  weapon4: ['千岩古剑', '祭礼剑', '西风长枪', '西风秘典', '绝弦']
}, {
  version: '5.3',
  half: '下半',
  from: '2025-01-21 18:00:00',
  to: '2025-02-11 14:59:59',
  char5: ['阿蕾奇诺', '克洛琳德'],
  char4: ['蓝砚', '夏沃蕾', '罗莎莉亚'],
  weapon5: ['赤月之形', '赦罪'],
  weapon4: ['千岩长枪', '匣里龙吟', '雨裁', '流浪乐章', '祭礼弓']
}, {
  version: '5.4',
  half: '上半',
  from: '2025-02-12 06:00:00',
  to: '2025-03-04 17:59:59',
  char5: ['梦见月瑞希', '希格雯'],
  char4: ['五郎', '早柚', '香菱'],
  weapon5: ['寝正月初晴', '白雨心弦'],
  weapon4: ['恶王丸', '断浪长鳍', '曚云之月', '笛剑', '昭心']
}, {
  version: '5.4',
  half: '下半',
  from: '2025-03-04 18:00:00',
  to: '2025-03-26 14:59:59',
  char5: ['芙宁娜', '莱欧斯利'],
  char4: ['夏洛蒂', '重云', '米卡'],
  weapon5: ['静水流涌之辉', '金流监督'],
  weapon4: ['西风剑', '祭礼大剑', '匣里灭辰', '祭礼残章', '弓藏']
}
]

export const mixPoolDetail = [{
  version: '4.5',
  half: '上半',
  from: '2024-03-13 06:00:00',
  to: '2024-04-02 17:59:59',
  char5: ['优菈', '阿贝多', '可莉'],
  weapon5: ['苇海信标', '松籁响起之时', '猎人之径'],
  weapon4: ['暗巷闪光', '暗巷的酒与诗', '幽夜华尔兹', '暗巷猎手']
}, {
  version: '5.3',
  half: '下半',
  from: '2025-01-21 18:00:00',
  to: '2025-02-11 14:59:59',
  char5: ['白术', '申鹤', '甘雨', '达达利亚', '魈'],
  weapon5: ['磐岩结绿', '斫峰之刃', '无工之剑', '息灾', '碧落之珑', '尘世之锁', '冬极白星'],
  weapon4: ['千岩古剑', '千岩长枪']
}]
